_posts/class/2018-08-13-training.html
---
layout: post
title: "猪猪培训课"
date: 2018-08-13
categories: 培训课
tags:
    - 猪猪培训课
excerpt:
keywords: ""
---

<div id="outline-container-org03d7592" class="outline-2">
<h2 id="org03d7592"><span class="section-number-2">1</span> 第一课、假冒网站</h2>
<div class="outline-text-2" id="text-1">
<p>
为了防止女王大人被一些小黑同学、小马同学误导，第一课先聊聊假冒网站 ：）
</p>

<p>
通常对于我们这些小白同学来说，可以简单认为，大多数有名有姓的网站安全性是我们不需要考虑的，更多时候我们是被一些假冒网站给欺骗了。
所以我们先从网站地址的真实性开始。
</p>
</div>

<div id="outline-container-org24a93a0" class="outline-3">
<h3 id="org24a93a0"><span class="section-number-3">1.1</span> 搜索引擎</h3>
<div class="outline-text-3" id="text-1-1">
<p>
不要无条件的相信搜索引擎，搜索引擎关注的更多是搜索，而不是安全，真假难辨的网页，何况还有坑爹的竞价排名啊，亲。
</p>
</div>
</div>

<div id="outline-container-org9739b39" class="outline-3">
<h3 id="org9739b39"><span class="section-number-3">1.2</span> 链接</h3>
<div class="outline-text-3" id="text-1-2">
<p>
网页上显示的链接不见得是真实链接地址，很容易设置的啊，亲。
比如我们点击下 <a href="https://www.jd.com">淘宝&lt;https://www.taobao.com/&gt;</a> 这个链接看看会去哪儿？
</p>

<p>
那我们该怎么做呢，其实很简单，把鼠标移到链接的上方，不要点击，先看看你的浏览器下方状态栏，大多数浏览器状态栏都会显示真实的链接地址。
</p>
</div>
</div>

<div id="outline-container-org7344d3d" class="outline-3">
<h3 id="org7344d3d"><span class="section-number-3">1.3</span> URL 地址</h3>
<div class="outline-text-3" id="text-1-3">
<p>
最重要的就是域名真实性，抛开域名劫持等不谈，一定要注意观察域名地址，地址里各段含义是不一样的，例如: <a href="http://user:password@www.maxthon.cn/mx5/">http://user:password@www.maxthon.cn/mx5/</a> ，根据协议的不同，URL 格式会发生变化。
</p>

<ul class="org-ul">
<li><code>http</code> ：这是协议名称，代表 http 协议，就是我们平常的网页浏览方式；</li>
<li><code>://</code> ： 是协议的分隔符。</li>
<li><code>user@passowrd</code> ：用户名和密码，通常在网页访问中不需要。</li>
<li><code>@</code> ：用户名密码和域名的分隔符。</li>
<li><code>www</code> ：这是子域名， <code>www</code> 通常设置和主域名地址一致；</li>
<li><code>maxthon.cn</code> ：这是 <b>最重要的主域名</b> ，通常这代表网站是否真实，经常会被小马同学用相近字符假冒， <code>0</code> 、 <code>o</code> 和 <code>1</code> 、 <code>l</code> 等，比如 <code>http://www.maxth0n.cn</code> ；</li>
<li><code>:80</code> ：这是网站服务器的协议端口号，80 端口是 http 的默认端口，可以省略不写。</li>
<li><code>mx5</code> ：这是网站子域名下的路径，表示某个功能资源页面。末尾的 <code>/</code> 代表访问 <code>mx5/</code> 目录下的缺省文件，如果末尾没有 <code>/</code> 代表访问 <code>mx5</code> 文件，如果找不到 <code>mx5</code> 文件，再去寻找 <code>mx5/</code> 目录，所以不要省略末尾的斜杠，会导致两次查找。如果网站做得不好，容易被劫持跳转到一个假冒网站，所以就算主域名是真实的，功能页面的字符串如果太长了也要仔细看看，是否包含其他网站的域名或 ip 地址等信息，如果有，就要小心了！</li>
</ul>

<p>
先简单说到这里，亲，随时要注意哈，坑太多了，对面和你聊天的真的有可能是只猪啊 ：）
</p>
</div>
</div>
</div>
